app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" ORDER BY created_at DESC
---
  def index
    @page = Page.all

SELECT "pages".* FROM "pages" ORDER BY created_at DESC
---
  def criminal
    @page = Page.all

SELECT "pages".* FROM "pages" ORDER BY created_at DESC
---
  def property
    @page = Page.all